# Taps
tap 'caskroom/cask'
tap 'caskroom/eid'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'homebrew/bundle'

# Binaries
# brew 'awscli'
# brew 'bash' # Bash 4
brew 'bat'
brew 'coreutils' # Those that come with macOS are outdated
brew 'direnv'
brew 'diff-so-fancy'
brew 'duti'
brew 'fd'
brew 'fzf'
brew 'git'
brew 'grep'
brew 'gpg'
brew 'htop'
brew 'jq'
brew 'kubernetes-cli'
brew 'mackup'
brew 'mas'
brew 'nnn'
brew 'openconnect'
brew 'openssl'
brew 'prettyping'
brew 'the_silver_searcher'
brew 'tldr'
brew 'trash'
brew 'tree'
brew 'zsh'
brew 'zsh-completions'
brew 'zsh-syntax-highlighting'

# Dev
brew 'golang'
brew 'rbenv'
brew 'ruby-build'
brew 'rbenv-default-gems'
brew 'python3'
brew 'rustup'

# Apps
cask 'aerial'
cask 'alfred'
cask 'appcleaner'
cask 'backblaze'
cask 'charles'
cask 'docker'
cask 'dropbox'
cask 'gimp'
cask 'google-backup-and-sync'
cask 'google-chrome'
cask 'gpg-suite'
cask 'graphql-playground'
cask 'iterm2'
cask 'keybase'
cask 'ngrok'
cask 'postman'
cask 'send-to-kindle'
cask 'slack'
# cask 'sourcetree'
cask 'spectacle'
cask 'sublime-text'
cask 'tor-browser'
cask 'transmission'
cask 'visual-studio-code'
cask 'vlc'

# Fonts
cask 'font-hack-nerd-font'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'
cask 'font-fira-code'

# Mac App Store
mas '1Password', id: 1333542190
mas 'Giphy Capture', id: 668208984
mas 'Keynote', id: 409183694
mas 'Kindle', id: 405399194
mas 'Microsoft OneNote', id: 784801555
mas 'Numbers', id: 409203825
mas 'Pages', id: 409201541
mas 'The Unarchiver', id: 425424353
mas 'WhatsApp', id: 1147396723
mas 'Speedtest', id: 1153157709
