# Taps
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'

# Binaries
# brew 'awscli'
# brew 'bash' # Bash 4
brew 'bat'
brew 'coreutils' # Those that come with macOS are outdated
brew 'direnv'
brew 'diff-so-fancy'
brew 'duti'
brew 'fd'
brew 'fzf'
brew 'git'
brew 'grep'
brew 'gpg'
brew 'htop'
brew 'jq'
brew 'kubernetes-cli'
brew 'mackup'
brew 'mas'
brew 'nnn'
brew 'openconnect'
brew 'openssl'
brew 'prettyping'
brew 'the_silver_searcher'
brew 'tldr'
brew 'trash'
brew 'tree'
brew 'zsh'
brew 'zsh-completions'
brew 'zsh-syntax-highlighting'

# Dev
brew 'golang'
brew 'rbenv'
brew 'ruby-build'
brew 'rbenv-default-gems'
brew 'python3'
brew 'rustup'

# Apps
cask 'appcleaner'
#cask 'backblaze'
cask 'docker'
#cask 'dropbox'
cask 'gimp'
#cask 'google-backup-and-sync'
cask 'google-chrome'
cask 'gpg-suite'
cask 'graphql-playground'
cask 'logseq'
cask 'iterm2'
cask 'keybase'
cask 'postman'
cask 'raycast'
#cask 'send-to-kindle'
cask 'slack'
# cask 'sourcetree'
#cask 'sublime-text'
#cask 'tor-browser'
#cask 'transmission'
cask 'visual-studio-code'

# Mac App Store
mas '1Password', id: 1333542190
#mas 'Kindle', id: 405399194
#mas 'Numbers', id: 409203825
#mas 'Pages', id: 409201541
mas 'The Unarchiver', id: 425424353
mas 'WhatsApp', id: 1147396723
mas 'Speedtest', id: 1153157709
